Revit 2026 API

# AdvancedLayeredSurfaceAlbedo Property

---

The property labeled "Color" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SurfaceAlbedo { get; }
```
```vb
Public Shared ReadOnly Property SurfaceAlbedo As String
	Get
```
```cpp
public:
static property String^ SurfaceAlbedo {
	String^ get ();
}
```
```fsharp
static member SurfaceAlbedo : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace